{"keras_version": "1.2.1", "config": [{"config": {"output_shape": null, "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-90fdadab8cb4>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_1", "bias": true, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "nb_filter": 24, "activation": "linear", "b_regularizer": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_2", "bias": true, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "nb_filter": 36, "activation": "linear", "b_regularizer": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_3", "bias": true, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "nb_filter": 48, "activation": "linear", "b_regularizer": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_4", "bias": true, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "nb_filter": 64, "activation": "linear", "b_regularizer": null, "nb_row": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_5", "bias": true, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "nb_filter": 64, "activation": "linear", "b_regularizer": null, "nb_row": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "input_dtype": "float32", "bias": true, "b_constraint": null, "output_dim": 128, "batch_input_shape": [null, 1152], "activation": "linear", "b_regularizer": null, "input_dim": 1152, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "p": 0.8, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "input_dtype": "float32", "bias": true, "b_constraint": null, "output_dim": 64, "batch_input_shape": [null, 128], "activation": "linear", "b_regularizer": null, "input_dim": 128, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_3", "p": 0.8, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_3", "input_dtype": "float32", "bias": true, "b_constraint": null, "output_dim": 16, "batch_input_shape": [null, 64], "activation": "linear", "b_regularizer": null, "input_dim": 64, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_4", "p": 0.8, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_4", "input_dtype": "float32", "bias": true, "b_constraint": null, "output_dim": 1, "batch_input_shape": [null, 16], "activation": "linear", "b_regularizer": null, "input_dim": 16, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}