{"config": [{"config": {"arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "name": "lambda_7", "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "nb_filter": 24, "subsample": [2, 2], "border_mode": "valid", "trainable": true, "b_constraint": null, "bias": true, "W_constraint": null, "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_31", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_55"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "nb_filter": 36, "subsample": [2, 2], "border_mode": "valid", "trainable": true, "b_constraint": null, "bias": true, "W_constraint": null, "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_32", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_56"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "nb_filter": 48, "subsample": [2, 2], "border_mode": "valid", "trainable": true, "b_constraint": null, "bias": true, "W_constraint": null, "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_33", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_57"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "b_constraint": null, "bias": true, "W_constraint": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_34", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_58"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "b_constraint": null, "bias": true, "W_constraint": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_35", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_59"}, "class_name": "ELU"}, {"config": {"p": 0.4, "trainable": true, "name": "dropout_13"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_7"}, "class_name": "Flatten"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_14"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_60"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "name": "dense_25", "batch_input_shape": [null, 1152], "W_regularizer": null, "b_regularizer": null, "input_dtype": "float32", "input_dim": 1152, "activation": "linear", "output_dim": 100}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_61"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "name": "dense_26", "batch_input_shape": [null, 100], "W_regularizer": null, "b_regularizer": null, "input_dtype": "float32", "input_dim": 100, "activation": "linear", "output_dim": 50}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_62"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "name": "dense_27", "batch_input_shape": [null, 50], "W_regularizer": null, "b_regularizer": null, "input_dtype": "float32", "input_dim": 50, "activation": "linear", "output_dim": 10}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_63"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "name": "dense_28", "batch_input_shape": [null, 10], "W_regularizer": null, "b_regularizer": null, "input_dtype": "float32", "input_dim": 10, "activation": "linear", "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}