{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u0000 @g\u0000\u0000\u0000\u0000\u0000\u00000@\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-b6142b7b9c9a>\u00da\b<lambda>F\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "lambda_7"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "nb_col": 3, "name": "convolution2d_7", "nb_row": 3, "dim_ordering": "tf", "nb_filter": 24, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_5", "alpha": 0.01}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "nb_col": 3, "name": "convolution2d_8", "nb_row": 3, "dim_ordering": "tf", "nb_filter": 36, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_6", "alpha": 0.01}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "nb_col": 3, "name": "convolution2d_9", "nb_row": 3, "dim_ordering": "tf", "nb_filter": 48, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_7", "alpha": 0.01}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "nb_col": 3, "name": "convolution2d_10", "nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_8", "alpha": 0.01}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "p": 0.15, "name": "spatialdropout2d_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "nb_col": 3, "name": "convolution2d_11", "nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_9", "alpha": 0.01}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "p": 0.15, "name": "spatialdropout2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 1164, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_1", "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 64], "init": "glorot_uniform", "input_dim": 64}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_10", "alpha": 0.01}}, {"class_name": "Dense", "config": {"output_dim": 100, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_2", "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 1164], "init": "glorot_uniform", "input_dim": 1164}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_11", "alpha": 0.01}}, {"class_name": "Dense", "config": {"output_dim": 50, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_3", "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 100], "init": "glorot_uniform", "input_dim": 100}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_12", "alpha": 0.01}}, {"class_name": "Dense", "config": {"output_dim": 10, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_4", "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 50], "init": "glorot_uniform", "input_dim": 50}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leakyrelu_13", "alpha": 0.01}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_5", "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 10], "init": "glorot_uniform", "input_dim": 10}}]}