{"config": [{"config": {"nb_col": 5, "nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "subsample": [2, 2], "bias": true, "W_constraint": null, "border_mode": "same", "name": "convolution2d_1", "batch_input_shape": [null, 64, 128, 3], "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 32, "input_dtype": "float32", "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_1", "beta_regularizer": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 3, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "trainable": true, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 16, "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_2", "beta_regularizer": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "trainable": true, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "border_mode": "valid", "name": "convolution2d_3", "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 16, "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_3", "beta_regularizer": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.4}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "trainable": true, "activation": "linear", "subsample": [2, 2], "bias": true, "W_constraint": null, "border_mode": "same", "name": "convolution2d_4", "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 16, "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_4", "beta_regularizer": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 336, "bias": true, "W_constraint": null, "name": "dense_1", "batch_input_shape": [null, 336], "b_constraint": null, "output_dim": 1024, "input_dtype": "float32", "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.3}, "class_name": "Dropout"}, {"config": {"name": "batchnormalization_5", "beta_regularizer": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 1024, "bias": true, "W_constraint": null, "name": "dense_2", "batch_input_shape": [null, 1024], "b_constraint": null, "output_dim": 512, "input_dtype": "float32", "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_6", "beta_regularizer": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 512, "bias": true, "W_constraint": null, "name": "dense_3", "batch_input_shape": [null, 512], "b_constraint": null, "output_dim": 32, "input_dtype": "float32", "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_7", "beta_regularizer": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 32, "bias": true, "W_constraint": null, "name": "dense_4", "batch_input_shape": [null, 32], "b_constraint": null, "output_dim": 1, "input_dtype": "float32", "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}