{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-1c2b5161c217>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "convolution2d_1", "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "nb_row": 3, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf", "subsample": [1, 1], "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "nb_row": 3, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf", "subsample": [1, 1], "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "batch_input_shape": [null, 1152], "b_regularizer": null, "input_dtype": "float32", "input_dim": 1152, "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "dense_1", "output_dim": 128, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.3}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "batch_input_shape": [null, 128], "b_regularizer": null, "input_dtype": "float32", "input_dim": 128, "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "dense_2", "output_dim": 64, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.3}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "batch_input_shape": [null, 64], "b_regularizer": null, "input_dtype": "float32", "input_dim": 64, "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "dense_3", "output_dim": 16, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.3}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "batch_input_shape": [null, 16], "b_regularizer": null, "input_dtype": "float32", "input_dim": 16, "b_constraint": null, "activation": "linear", "W_constraint": null, "name": "dense_4", "output_dim": 1, "W_regularizer": null}}], "keras_version": "1.2.1"}