{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 32, "border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_1", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 1], "bias": true, "nb_col": 5, "nb_row": 5, "activation": "linear", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "beta_regularizer": null, "trainable": true, "axis": -1, "momentum": 0.99, "name": "batchnormalization_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 64, "border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_2", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_col": 5, "nb_row": 5, "activation": "linear", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "beta_regularizer": null, "trainable": true, "axis": -1, "momentum": 0.99, "name": "batchnormalization_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 128, "border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_3", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_col": 5, "nb_row": 5, "activation": "linear", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "beta_regularizer": null, "trainable": true, "axis": -1, "momentum": 0.99, "name": "batchnormalization_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 2048, "W_constraint": null, "input_dim": 2048, "activity_regularizer": null, "name": "dense_1", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dtype": "float32", "bias": true, "batch_input_shape": [null, 2048], "activation": "linear", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "beta_regularizer": null, "trainable": true, "axis": -1, "momentum": 0.99, "name": "batchnormalization_4"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1024, "W_constraint": null, "input_dim": 2048, "activity_regularizer": null, "name": "dense_2", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dtype": "float32", "bias": true, "batch_input_shape": [null, 2048], "activation": "linear", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "beta_regularizer": null, "trainable": true, "axis": -1, "momentum": 0.99, "name": "batchnormalization_5"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 128, "W_constraint": null, "input_dim": 1024, "activity_regularizer": null, "name": "dense_3", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dtype": "float32", "bias": true, "batch_input_shape": [null, 1024], "activation": "linear", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "beta_regularizer": null, "trainable": true, "axis": -1, "momentum": 0.99, "name": "batchnormalization_6"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "input_dim": 128, "activity_regularizer": null, "name": "dense_4", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dtype": "float32", "bias": true, "batch_input_shape": [null, 128], "activation": "linear", "trainable": true}}]}