{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "trainable": true, "function_type": "lambda", "name": "lambda_7", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 24, "name": "convolution2d_31", "W_constraint": null, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_55"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 36, "name": "convolution2d_32", "W_constraint": null, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_56"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 48, "name": "convolution2d_33", "W_constraint": null, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_57"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 64, "name": "convolution2d_34", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_58"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "bias": true, "b_constraint": null, "W_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 64, "name": "convolution2d_35", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_59"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_13"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_14"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_60"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "input_dim": 1152, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "name": "dense_25", "batch_input_shape": [null, 1152], "b_regularizer": null, "W_regularizer": null, "output_dim": 100}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_61"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "input_dim": 100, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "name": "dense_26", "batch_input_shape": [null, 100], "b_regularizer": null, "W_regularizer": null, "output_dim": 50}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_62"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "input_dim": 50, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "name": "dense_27", "batch_input_shape": [null, 50], "b_regularizer": null, "W_regularizer": null, "output_dim": 10}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_63"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "input_dim": 10, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "name": "dense_28", "batch_input_shape": [null, 10], "b_regularizer": null, "W_regularizer": null, "output_dim": 1}}]}