{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "output_shape_type": "raw", "input_dtype": "float32", "trainable": true, "output_shape": null, "arguments": {}, "name": "lambda_7"}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 5, "name": "convolution2d_31", "nb_filter": 24, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_55", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 5, "name": "convolution2d_32", "nb_filter": 36, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_56", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 5, "name": "convolution2d_33", "nb_filter": 48, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_57", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "name": "convolution2d_34", "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_58", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "name": "convolution2d_35", "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_59", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_13", "p": 0.4}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_14", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_60", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_25", "activity_regularizer": null, "input_dim": 1152, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "output_dim": 100, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 1152], "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_61", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_26", "activity_regularizer": null, "input_dim": 100, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "output_dim": 50, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 100], "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_62", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_27", "activity_regularizer": null, "input_dim": 50, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "output_dim": 10, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 50], "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_63", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_28", "activity_regularizer": null, "input_dim": 10, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 10], "b_constraint": null}}]}