{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_7", "function_type": "lambda", "arguments": {}, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 5, "name": "convolution2d_31", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 24, "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_55", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 5, "name": "convolution2d_32", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 36, "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_56", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 5, "name": "convolution2d_33", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 48, "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_57", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "name": "convolution2d_34", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_58", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "name": "convolution2d_35", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_59", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_13", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_14", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_60", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_25", "output_dim": 100, "trainable": true, "b_constraint": null, "batch_input_shape": [null, 1152], "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "input_dim": 1152, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_61", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_26", "output_dim": 50, "trainable": true, "b_constraint": null, "batch_input_shape": [null, 100], "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "input_dim": 100, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_62", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_27", "output_dim": 10, "trainable": true, "b_constraint": null, "batch_input_shape": [null, 50], "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "input_dim": 50, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_63", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_28", "output_dim": 1, "trainable": true, "b_constraint": null, "batch_input_shape": [null, 10], "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "input_dim": 10, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32"}}], "keras_version": "1.2.1"}