{"config": [{"config": {"input_dtype": "float32", "name": "lambda_7", "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_31", "b_constraint": null, "nb_row": 5, "subsample": [2, 2], "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 24, "border_mode": "valid", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_55"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_32", "b_constraint": null, "nb_row": 5, "subsample": [2, 2], "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 36, "border_mode": "valid", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_56"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_33", "b_constraint": null, "nb_row": 5, "subsample": [2, 2], "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 48, "border_mode": "valid", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_57"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_34", "b_constraint": null, "nb_row": 3, "subsample": [1, 1], "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "border_mode": "valid", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_58"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_35", "b_constraint": null, "nb_row": 3, "subsample": [1, 1], "trainable": true, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "border_mode": "valid", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_59"}, "class_name": "ELU"}, {"config": {"p": 0.4, "trainable": true, "name": "dropout_13"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_7"}, "class_name": "Flatten"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_14"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_60"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "output_dim": 100, "W_regularizer": null, "name": "dense_25", "bias": true, "activation": "linear", "input_dim": 1152, "trainable": true, "batch_input_shape": [null, 1152], "b_regularizer": null, "input_dtype": "float32", "b_constraint": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_61"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "output_dim": 50, "W_regularizer": null, "name": "dense_26", "bias": true, "activation": "linear", "input_dim": 100, "trainable": true, "batch_input_shape": [null, 100], "b_regularizer": null, "input_dtype": "float32", "b_constraint": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_62"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "output_dim": 10, "W_regularizer": null, "name": "dense_27", "bias": true, "activation": "linear", "input_dim": 50, "trainable": true, "batch_input_shape": [null, 50], "b_regularizer": null, "input_dtype": "float32", "b_constraint": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_63"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "name": "dense_28", "bias": true, "activation": "linear", "input_dim": 10, "trainable": true, "batch_input_shape": [null, 10], "b_regularizer": null, "input_dtype": "float32", "b_constraint": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}