{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "name": "lambda_7", "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 24, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_31", "activation": "linear", "nb_row": 5, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_55", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 36, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_32", "activation": "linear", "nb_row": 5, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_56", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 48, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_33", "activation": "linear", "nb_row": 5, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_57", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 64, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_34", "activation": "linear", "nb_row": 3, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_58", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "nb_filter": 64, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_35", "activation": "linear", "nb_row": 3, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_59", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "p": 0.4, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_60", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 1152], "trainable": true, "W_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "name": "dense_25", "activation": "linear", "output_dim": 100, "input_dim": 1152}}, {"class_name": "ELU", "config": {"name": "elu_61", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 100], "trainable": true, "W_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "name": "dense_26", "activation": "linear", "output_dim": 50, "input_dim": 100}}, {"class_name": "ELU", "config": {"name": "elu_62", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 50], "trainable": true, "W_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "name": "dense_27", "activation": "linear", "output_dim": 10, "input_dim": 50}}, {"class_name": "ELU", "config": {"name": "elu_63", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 10], "trainable": true, "W_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "name": "dense_28", "activation": "linear", "output_dim": 1, "input_dim": 10}}], "keras_version": "1.2.1"}