{"config": [{"config": {"input_dtype": "float32", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "name": "lambda_7", "trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"nb_row": 5, "bias": true, "dim_ordering": "tf", "nb_filter": 24, "trainable": true, "name": "convolution2d_31", "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "b_constraint": null, "nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_55", "trainable": true}, "class_name": "ELU"}, {"config": {"nb_row": 5, "bias": true, "dim_ordering": "tf", "nb_filter": 36, "trainable": true, "name": "convolution2d_32", "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "b_constraint": null, "nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_56", "trainable": true}, "class_name": "ELU"}, {"config": {"nb_row": 5, "bias": true, "dim_ordering": "tf", "nb_filter": 48, "trainable": true, "name": "convolution2d_33", "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "b_constraint": null, "nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_57", "trainable": true}, "class_name": "ELU"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "nb_filter": 64, "trainable": true, "name": "convolution2d_34", "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "b_constraint": null, "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_58", "trainable": true}, "class_name": "ELU"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "nb_filter": 64, "trainable": true, "name": "convolution2d_35", "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "b_constraint": null, "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_59", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_13", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "flatten_7", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_14", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_60", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activity_regularizer": null, "batch_input_shape": [null, 1152], "trainable": true, "name": "dense_25", "activation": "linear", "W_regularizer": null, "b_constraint": null, "input_dim": 1152, "output_dim": 100, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_61", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activity_regularizer": null, "batch_input_shape": [null, 100], "trainable": true, "name": "dense_26", "activation": "linear", "W_regularizer": null, "b_constraint": null, "input_dim": 100, "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_62", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activity_regularizer": null, "batch_input_shape": [null, 50], "trainable": true, "name": "dense_27", "activation": "linear", "W_regularizer": null, "b_constraint": null, "input_dim": 50, "output_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_63", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activity_regularizer": null, "batch_input_shape": [null, 10], "trainable": true, "name": "dense_28", "activation": "linear", "W_regularizer": null, "b_constraint": null, "input_dim": 10, "output_dim": 1, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dtype": "float32"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}