{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_7", "output_shape": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_31", "trainable": true, "nb_row": 5, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 24, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_55", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_32", "trainable": true, "nb_row": 5, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 36, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_56", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_33", "trainable": true, "nb_row": 5, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 48, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_57", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "name": "convolution2d_34", "trainable": true, "nb_row": 3, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_58", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "name": "convolution2d_35", "trainable": true, "nb_row": 3, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_59", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_13", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_14", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_60", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 1152], "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_25", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 1152, "output_dim": 100, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_61", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 100], "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_26", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 100, "output_dim": 50, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_62", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 50], "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_27", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 50, "output_dim": 10, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_63", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 10], "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_28", "input_dtype": "float32", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 10, "output_dim": 1, "activity_regularizer": null, "bias": true}}]}