{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "input_dtype": "float32", "name": "lambda_7", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-21-52061f8b769b>\u00da\b<lambda>\u001d\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "function_type": "lambda", "output_shape": null, "trainable": true, "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_row": 5, "bias": true, "name": "convolution2d_31", "b_constraint": null, "W_regularizer": null, "nb_filter": 24}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_55"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_row": 5, "bias": true, "name": "convolution2d_32", "b_constraint": null, "W_regularizer": null, "nb_filter": 36}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_56"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_row": 5, "bias": true, "name": "convolution2d_33", "b_constraint": null, "W_regularizer": null, "nb_filter": 48}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_57"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "nb_col": 3, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "subsample": [1, 1], "nb_row": 3, "bias": true, "name": "convolution2d_34", "b_constraint": null, "W_regularizer": null, "nb_filter": 64}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_58"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "nb_col": 3, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "subsample": [1, 1], "nb_row": 3, "bias": true, "name": "convolution2d_35", "b_constraint": null, "W_regularizer": null, "nb_filter": 64}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_59"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_13", "p": 0.4}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_14", "p": 0.5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_60"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "input_dtype": "float32", "output_dim": 100, "batch_input_shape": [null, 1152], "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_25", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dim": 1152, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_61"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "input_dtype": "float32", "output_dim": 50, "batch_input_shape": [null, 100], "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_26", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dim": 100, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_62"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "input_dtype": "float32", "output_dim": 10, "batch_input_shape": [null, 50], "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_27", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dim": 50, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_63"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "input_dtype": "float32", "output_dim": 1, "batch_input_shape": [null, 10], "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_28", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dim": 10, "activation": "linear"}}]}